lsoldano93/ECSE426/Lab3_STM32F4Cube_Base_project/Sources/main.c
/**
  ******************************************************************************
  * File Name          : main.c
  * Description        : Main program subroutine
	* Author						 : Ashraf Suyyagh
	* Version            : 1.0.0
	* Date							 : January 14th, 2016
  ******************************************************************************
  */
	
/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"
#include "supporting_functions.h"
#include "lis3dsh.h"
#include "sys_config.h"
#include "accelerometer.h"
#include "7_segment.h"

/* Private variables ---------------------------------------------------------*/

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config	(void);

//array of size 3 that contains the accelerometer output
float accelerometer_out[3];

//interupt for accelerometer
uint8_t ready_to_update_accelerometer;

/*
	* 
  * @brief Structure for the Kalman filter  
*/ 

typedef struct kalman_t{
	float q;
	float r;
	float x;
	float p;
	float k;
} kalman_t;


/**  Assembly Kalmann filter function
   * @brief  Filters values to remove noisy fluctuations
	 * @param  Input value of measurements, array to output to, length of arrays, and kalman parameter struct
   * @retval Returns updated output array **/
int Kalmanfilter_asm(float* inputArray, float* outputArray, int arrayLength, kalman_t* kalman);


//this function initialize the interrupts for the accelerometer
void init_interrupts() {
	
	// Set GPIO pin PE0 as interrupt input for acceleromter data 
	// set PE0 as the interupt for the accelorometer
	GPIO_InitTypeDef GPIO_InitE;
	
	// Enable clocks for ports E
	__HAL_RCC_GPIOE_CLK_ENABLE();
	_HAL_RCC_SYSCFIG_CLK_ENABLE();

	// Give initialization values for GPIO E pin sets
	GPIO_InitE.Pin = GPIO_PIN_0 ;
	GPIO_InitE.Mode = GPIO_MODE_IT_RISING; //pin needs to be set in interrupt mode, not sure if to use rising/falling edge
	GPIO_InitE.Pull = GPIO_PULLDOWN;
	GPIO_InitE.Speed =  GPIO_SPEED_FREQ_VERY_HIGH;
	
	// Initialize GPIO PE0
	HAL_GPIO_Init(GPIOE, &GPIO_InitE);	
	
	//enable external interrupt line 0
	//SYSCFG_EXTICR1_EXTI0_PE is pin PE0
	HAL_GPIO_EXTI_IRQHandler(SYSCFG_EXTICR1_EXTI0_PE);
	
	// set up NVIC
	// PE0 is connected to EXTI_Line0, which has EXTI0_IRQn vector 
	//HAL_NVIC_SetPriorityGrouping(NVIC_PRIORITYGROUP_0); //not sure if we need this one
	HAL_NVIC_SetPriority(EXTI0_IRQn, 0, 0); //set group and sub priority
	HAL_NVIC_EnableIRQ(EXTI0_IRQn);

}

void EXTI0_IRQHandler(void){
	
	/* EXTI line interrupt detected */
  if(__HAL_GPIO_EXTI_GET_IT(EXTI0_IRQn) != RESET) {

		__HAL_GPIO_EXTI_CLEAR_IT(EXTI0_IRQn);
		LIS3DSH_ReadACC(accelerometer_out);

		ready_to_update_accelerometer = 1;
  }

}

int main(void)
{	
  /* MCU Configuration----------------------------------------------------------*/

  HAL_Init();

  /* Configure the system clock */
  SystemClock_Config();
	
  /* Initialize all configured peripherals */
	
	init_interrupts(); //initialize accelerometer interrupt
	init_accelerometer(); //initialize accelerometer
	__HAL_GPIO_EXTI_GENERATE_SWIT(EXTI0_IRQn); //create software interrupt
	
	ready_to_update_accelerometer = 0; //set accelerometer initally to 0

	printf("Start");
	//run when interrupt received
	while (1){
		
		if(ready_to_update_accelerometer == 1) {
			
			//reset interrupt
			printf("flag set\n");
			ready_to_update_accelerometer = 0;
			
			//update real accelerometer values
			//update_accel_values(accelerometer_out[0], accelerometer_out[1], accelerometer_out[2]);
			
			//printf("Tilt: %f, Rotation: %f\n", fabs(calc_pitch_angle()), fabs(calc_roll_angle()));
			
		}
		
	}
	
	return 0;
}

/** System Clock Configuration*/
void SystemClock_Config(void){

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;

  __PWR_CLK_ENABLE();

  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

  RCC_OscInitStruct.OscillatorType 	= RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState 			 	= RCC_HSE_ON;
  RCC_OscInitStruct.PLL.PLLState 		= RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource 	= RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM 				= 8;
  RCC_OscInitStruct.PLL.PLLN 				= 336;
  RCC_OscInitStruct.PLL.PLLP 				= RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ 				= 7;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK){Error_Handler(RCC_CONFIG_FAIL);};

  RCC_ClkInitStruct.ClockType 			= RCC_CLOCKTYPE_SYSCLK|RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource 		= RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider 	= RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider 	= RCC_HCLK_DIV4;
  RCC_ClkInitStruct.APB2CLKDivider 	= RCC_HCLK_DIV2;
  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_5)!= HAL_OK){Error_Handler(RCC_CONFIG_FAIL);};
	
	/*Configures SysTick to provide 1ms interval interrupts. SysTick is already 
	  configured inside HAL_Init, I don't kow why the CubeMX generates this call again*/
  HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);

	/* This function sets the source clock for the internal SysTick Timer to be the maximum,
	   in our case, HCLK is now 168MHz*/
  HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

  /* SysTick_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
}

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line){
}
#endif

